Autodesk.Revit.DB.Structure.TranslationRotationValue
Values for BoundaryConditions Translation and Rotation parameters.

Autodesk.Revit.DB.Structure.TranslationRotationValue.Spring
TranslationRotationValue is Spring.

Autodesk.Revit.DB.Structure.TranslationRotationValue.Release
TranslationRotationValue is Release.

Autodesk.Revit.DB.Structure.TranslationRotationValue.Fixed
TranslationRotationValue is Fixed.